#### Raviteja Padala
<img align="left" img src= in.png height = 20 width="20"/>   https://www.linkedin.com/in/raviteja-padala/ <br>

<img align="left" img src= github.png height = 20 width="20"/> https://github.com/raviteja-padala

# Objective: To learn and practice different SQL Statements, SQL functions, Operators and their usage

<a id="0"></a>

## Contents

1. [Connecting, loading, Accessing data](#1.Connecting_Loading_Accessing) <br> 

2. [Aggregate functions](#2.Aggregate_functions) <br>
    2.1.[COUNT() Function](#2.1.COUNT())<br>
    2.2.[SUM() Function](#2.2.SUM())<br>
    2.3.[AVG() Function](#2.3.AVG())<br>
    2.4.[MAX() Function](#2.2.MAX())<br>
    2.5.[MIN() Function](#2.2.MIN())<br>
3. [Clause in SQL](#3.Clause)<br>
    3.1. [Where clause](#3.1.Where)<br>
    3.2. [Group By clause](#3.2.Group_by)<br>
    3.3. [Having clause](#3.3.Having)<br>
    3.4. [Order_by clause](#3.4.Order_by)<br>
    3.5. [Limit](#3.5.Limit)<br>
    3.6. [Offset](#3.6.Offset)<br>
4. [SQL LOGICAL OPERATORS](#4.Logical_operators)<br>
    4.1. [And Operator](#4.1.AND)<br>
    4.2. [OR Operator](#4.2.OR)<br>
    4.3. [Between Operator](#4.3.BETWEEN)<br>
    4.4. [In Operator](#4.4.IN)<br>
    4.5. [Not Operator](#4.5.NOT)<br>
    4.6. [Like Operator](#4.6.LIKE)<br>
    4.7. [Exists Operator](#4.7.EXISTS)<br>
5. [REGEXP operator](#5.REGEXP)<br>
6. [IS NULL operator](#6.IS_NULL)<br>
7. [Duplicate_records](#7.Duplicate_records)<br>
8. [If function](#8.If)<br>
9. [VIEW](#9.VIEW)<br>
10.[Substring](#10.substr)
11.[CASE_statement](#11.CASE_statement)
12.[Sub QUERY](#12.Subquery)

# 1.Connecting_Loading_Accessing

In [1]:
#loading SQLITE
%load_ext sql

In [2]:
#LOADING REQUIRED DATABASE 

%sql sqlite:///db_sales

In [3]:
# view tables in the database
      
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///db_sales
Done.

[('sales_d',)]

In [4]:
# accesing a table
%sql SELECT * FROM sales_d limit 5;

 * sqlite:///db_sales
Done.

[(0, 'AG-2011-2040', '01-01-2011', '01-06-2011', 'Standard Class', 'Toby Braunhardt', 'Consumer', 'Constantine', 'Algeria', 'Africa', 'Africa', 'OFF-TEN-10000025', 'Office Supplies', 'Storage', 'Tenex Lockers, Blue', '408', 2, 0.0, 106.14, 35.46, 'Medium', 2011),
 (1, 'IN-2011-47883', '01-01-2011', '01-08-2011', 'Standard Class', 'Joseph Holt', 'Consumer', 'New South Wales', 'Australia', 'APAC', 'Oceania', 'OFF-SU-10000618', 'Office Supplies', 'Supplies', 'Acme Trimmer, High Speed', '120', 3, 0.1, 36.036, 9.72, 'Medium', 2011),
 (2, 'HU-2011-1220', '01-01-2011', '01-05-2011', 'Second Class', 'Annie Thurman', 'Consumer', 'Budapest', 'Hungary', 'EMEA', 'EMEA', 'OFF-TEN-10001585', 'Office Supplies', 'Storage', 'Tenex Box, Single Width', '66', 4, 0.0, 29.64, 8.17, 'High', 2011),
 (3, 'IT-2011-3647632', '01-01-2011', '01-05-2011', 'Second Class', 'Eugene Moren', 'Home Office', 'Stockholm', 'Sweden', 'EU', 'North', 'OFF-PA-10001492', 'Office Supplies', 'Paper', 'Enermax Note Cards, Premium', '45', 3, 0.5, -26.055, 4.82, 'High', 2011),
 (4, 'IN-2011-47883', '01-01-2011', '01-08-2011', 'Standard Class', 'Joseph Holt', 'Consumer', 'New South Wales', 'Australia', 'APAC', 'Oceania', 'FUR-FU-10003447', 'Furniture', 'Furnishings', 'Eldon Light Bulb, Duo Pack', '114', 5, 0.1, 37.77, 4.7, 'Medium', 2011)]

---

# 2.Aggregate_functions

* An aggregate function in SQL performs a calculation on multiple values and returns a single value. SQL provides many aggregate functions that include avg, count, sum, min, max, etc. An aggregate function ignores NULL values when it performs the calculation, except for the count function.

* We often use aggregate functions with the GROUP BY and HAVING clauses of the SELECT statement.

* Various types of SQL aggregate functions are: Count(),Sum(),Avg(),Min(),Max()

### 2.1.COUNT()
* The COUNT() function returns the number of rows in a database table.

In [5]:
#COUNT ALL VALUES
%sql SELECT COUNT(*) FROM sales_d;

 * sqlite:///db_sales
Done.

[(51290,)]

In [6]:
#COUNT SPECIFI COLUMN
%sql SELECT COUNT(customer_name) FROM sales_d;

 * sqlite:///db_sales
Done.

[(51290,)]

In [7]:
#count with distinct
%sql SELECT COUNT(DISTINCT region) FROM sales_d;

 * sqlite:///db_sales
Done.

[(13,)]

In [8]:
#verifying distinct vaclues
%sql SELECT DISTINCT[region] FROM sales_d;

 * sqlite:///db_sales
Done.

[('Africa',),
 ('Oceania',),
 ('EMEA',),
 ('North',),
 ('Canada',),
 ('Southeast Asia',),
 ('Central',),
 ('South',),
 ('Caribbean',),
 ('North Asia',),
 ('East',),
 ('West',),
 ('Central Asia',)]

In [9]:
#COUNT with WHERE 
%sql SELECT COUNT(sales) FROM sales_d WHERE profit>500;

 * sqlite:///db_sales
Done.

[(678,)]

In [10]:
#COUNT() with GROUP BY

%sql SELECT region, COUNT(sales) FROM sales_d GROUP BY region;

 * sqlite:///db_sales
Done.

[('Africa', 4586),
 ('Canada', 384),
 ('Caribbean', 1689),
 ('Central', 11115),
 ('Central Asia', 2048),
 ('EMEA', 5028),
 ('East', 2848),
 ('North', 4785),
 ('North Asia', 2338),
 ('Oceania', 3486),
 ('South', 6645),
 ('Southeast Asia', 3129),
 ('West', 3203)]

### 2.2.SUM()
* Sum function is used to calculate the sum of all selected columns. It works on numeric fields only.

In [11]:
#total sum of profit in sales table
%sql SELECT SUM(profit) FROM sales_d;

 * sqlite:///db_sales
Done.

[(1469034.8212799944,)]

In [12]:
#SUM() with WHERE

%sql SELECT SUM(sales) FROM sales_d WHERE region = 'Africa';

 * sqlite:///db_sales
Done.

[(538221.0,)]

In [13]:
#SUM() with GROUP BY

%sql SELECT region, SUM(sales) FROM sales_d GROUP BY region;

 * sqlite:///db_sales
Done.

[('Africa', 538221.0),
 ('Canada', 50326.0),
 ('Caribbean', 251457.0),
 ('Central', 1807422.0),
 ('Central Asia', 389796.0),
 ('EMEA', 575691.0),
 ('East', 366752.0),
 ('North', 790907.0),
 ('North Asia', 454002.0),
 ('Oceania', 625675.0),
 ('South', 1031558.0),
 ('Southeast Asia', 532448.0),
 ('West', 424418.0)]

In [14]:
# SUM() with HAVING

%sql SELECT region, SUM(sales) FROM sales_d GROUP BY region HAVING SUM(sales)<500000;

 * sqlite:///db_sales
Done.

[('Canada', 50326.0),
 ('Caribbean', 251457.0),
 ('Central Asia', 389796.0),
 ('East', 366752.0),
 ('North Asia', 454002.0),
 ('West', 424418.0)]

### 2.3.AVG()
* The AVG() function calculates the average of a set of values.

In [15]:
%sql SELECT AVG(quantity) FROM sales_d;

 * sqlite:///db_sales
Done.

[(3.4765451355039967,)]

In [16]:
#ROUND() function will round a number value to a specified number of places. 
%sql SELECT round(AVG(quantity)) FROM sales_d;

 * sqlite:///db_sales
Done.

[(3.0,)]

In [17]:
%sql SELECT region, round(AVG(quantity)) FROM sales_d GROUP BY region;

 * sqlite:///db_sales
Done.

[('Africa', 2.0),
 ('Canada', 2.0),
 ('Caribbean', 4.0),
 ('Central', 4.0),
 ('Central Asia', 4.0),
 ('EMEA', 2.0),
 ('East', 4.0),
 ('North', 4.0),
 ('North Asia', 4.0),
 ('Oceania', 4.0),
 ('South', 4.0),
 ('Southeast Asia', 4.0),
 ('West', 4.0)]

### 2.4.MAX()
* The MAX() aggregate function returns the highest value (maximum) in a set of non-NULL values.

In [18]:
%sql SELECT MAX(quantity) FROM sales_d;

 * sqlite:///db_sales
Done.

[(14,)]

In [19]:
%sql SELECT segment, (MAX(quantity)) FROM sales_d GROUP BY segment;

 * sqlite:///db_sales
Done.

[('Consumer', 14), ('Corporate', 14), ('Home Office', 14)]

### 2.5.MIN()
* The MIN() aggregate function returns the lowest value (minimum) in a set of non-NULL values.

In [20]:
%sql SELECT MIN(quantity) FROM sales_d;

 * sqlite:///db_sales
Done.

[(1,)]

In [21]:
%sql SELECT segment, (MIN(quantity)) FROM sales_d GROUP BY segment;

 * sqlite:///db_sales
Done.

[('Consumer', 1), ('Corporate', 1), ('Home Office', 1)]

In [22]:
# All aggregation functions
%sql SELECT MAX(quantity), ROUND(AVG(quantity)), MIN(quantity) FROM sales_d;

 * sqlite:///db_sales
Done.

[(14, 3.0, 1)]

In [23]:
# All aggregation functions
%sql SELECT region, MAX(profit), ROUND(AVG(profit)), MIN(profit) FROM sales_d where region = 'Africa';

 * sqlite:///db_sales
Done.

[('Africa', 2597.28, 19.0, -1576.824)]

In [24]:
# All aggregation functions
%sql SELECT region,segment,MAX(profit),ROUND(AVG(profit)),MIN(profit) FROM sales_d where region ='Africa' GROUP BY segment;

 * sqlite:///db_sales
Done.

[('Africa', 'Consumer', 1563.48, 20.0, -1576.824),
 ('Africa', 'Corporate', 2597.28, 16.0, -1150.83),
 ('Africa', 'Home Office', 1098.24, 23.0, -1558.152)]

---

# 3.Clause
* A clause in SQL is a built-in function that helps to fetch the required records from a database table. A clause receives a conditional expression, i.e. a column name or some terms involving the columns. The clause calculates the result based on the given statements in the expression.

### 3.1.Where

* The WHERE clause in SQL is used to fetch the data or certain records that match the specified condition in the SELECT statement. SQL's WHERE clause is also used with the DELETE, UPDATE, etc. statements.

In [25]:
%sql SELECT COUNT(DISTINCT(region)) FROM sales_d WHERE market = 'EU';

 * sqlite:///db_sales
Done.

[(3,)]

In [26]:
%sql SELECT DISTINCT(region) FROM sales_d WHERE market = 'EU';

 * sqlite:///db_sales
Done.

[('North',), ('Central',), ('South',)]

### 3.2.Group_by

* GROUP BY statement is used to arrange identical data into groups.

In [27]:
%sql SELECT market, segment, profit FROM sales_d WHERE market = 'EU' Group by segment;

 * sqlite:///db_sales
Done.

[('EU', 'Consumer', 290.43),
 ('EU', 'Corporate', -21.9),
 ('EU', 'Home Office', -26.055)]

In [28]:
%sql SELECT year, market, profit FROM sales_d WHERE market = 'EU' Group by year;

 * sqlite:///db_sales
Done.

[(2011, 'EU', -26.055),
 (2012, 'EU', 9.66),
 (2013, 'EU', 116.292),
 (2014, 'EU', -111.6225)]

### 3.3.Having
* HAVING clause is used to specify a search condition for a group or an aggregate. Having is used in a GROUP BY clause.

In [29]:
%sql SELECT year, market, profit FROM sales_d WHERE market = 'EMEA' Group by year HAVING sales> 1000;

 * sqlite:///db_sales
Done.

[(2011, 'EMEA', 29.64),
 (2012, 'EMEA', 12.06),
 (2013, 'EMEA', 0.45),
 (2014, 'EMEA', 23.82)]

### 3.4.Order_by

* The ORDER BY clause sorts the result-set in ascending or descending order.It sorts the records in ascending order by default. DESC keyword is used to sort the records in descending order.

In [30]:
%sql SELECT category,profit,sales FROM sales_d WHERE market='Africa' Group by category HAVING sales>1000 Order By 'Sales';

 * sqlite:///db_sales
Done.

[('Furniture', 49.5, '2,479'),
 ('Office Supplies', 106.14, '408'),
 ('Technology', 12.72, '28')]

### 3.5.Limit
The LIMIT clause is used to limit the data amount fetched by SELECT command from a table.

In [31]:
%sql SELECT category ,round(profit), shipping_cost FROM sales_d Order by shipping_cost DESC LIMIT 5;

 * sqlite:///db_sales
Done.

[('Technology', 762.0, 933.57),
 ('Furniture', 1289.0, 923.63),
 ('Technology', 920.0, 915.49),
 ('Technology', -97.0, 910.16),
 ('Technology', 312.0, 903.04)]

### 3.6.Offset

* OFFSET is used to specify an OFFSET from where to start returning data.

In [32]:
%sql SELECT category ,round(profit), shipping_cost FROM sales_d Order by shipping_cost DESC LIMIT 5 OFFSET 2;

 * sqlite:///db_sales
Done.

[('Technology', 920.0, 915.49),
 ('Technology', -97.0, 910.16),
 ('Technology', 312.0, 903.04),
 ('Technology', 763.0, 897.35),
 ('Furniture', 565.0, 894.77)]

---

# 4.Logical_operators
* SQL logical operators are used to test for the truth of the condition.

### 4.1.AND

* The SQL AND operator is used with the where clause in the SQL Query. AND operator in SQL returns only those records which satisfy both the conditions in the SQL query.

In [33]:
%sql SELECT DISTINCT(year), round(profit), sales FROM sales_d where profit>1500 AND sales > 600000;

 * sqlite:///db_sales
Done.

[(2011, 4630.0, '9,450'),
 (2011, 2240.0, '7,000'),
 (2013, 2800.0, '8,750'),
 (2013, 2366.0, '9,100'),
 (2013, 4946.0, '9,893'),
 (2014, 3979.0, '7,959')]

---

### 4.2.OR
* OR operator returns those records if any of the conditions separated by OR is TRUE

In [34]:
%sql SELECT DISTINCT(year) FROM sales_d where profit>5000 OR sales >6000000;

 * sqlite:///db_sales
Done.

[(2011,), (2012,), (2013,), (2014,)]

---

### 4.3.BETWEEN
* BETWEEN Operator displays the records which fall between the given ranges in the SQL query. The results of the BETWEEN operator include begin and end values of the given range.

In [35]:
%sql SELECT DISTINCT(country), round(profit) FROM sales_d WHERE profit BETWEEN 1700 AND 2000 Order by profit DESC;

 * sqlite:///db_sales
Done.

[('United States', 1996.0),
 ('United Kingdom', 1990.0),
 ('Italy', 1990.0),
 ('United States', 1906.0),
 ('United Kingdom', 1898.0),
 ('France', 1868.0),
 ('United Kingdom', 1759.0),
 ('Japan', 1722.0)]

---

### 4.4.IN 
* When we want to check for one or more than one value in a single SQL query, we use IN operator with the WHERE clause in a SELECT query.

In [36]:
%sql SELECT category, profit, year FROM sales_d WHERE year IN('2011') Group by category Order by profit DESC;

 * sqlite:///db_sales
Done.

[('Office Supplies', 106.14, 2011),
 ('Furniture', 37.77, 2011),
 ('Technology', 3.12, 2011)]

---

### 4.5.NOT
* NOT operator in SQL shows those records from the table where the criteria is not met. NOT operator is used with where clause in a SELECT query.

In [37]:
%sql SELECT category, discount, year FROM sales_d WHERE year NOT IN('2011') Group by category Order by discount DESC;

 * sqlite:///db_sales
Done.

[('Furniture', 0.27, 2012),
 ('Office Supplies', 0.17, 2012),
 ('Technology', 0.0, 2012)]

In [38]:
%sql SELECT category, discount, year FROM sales_d WHERE NOT year = '2011' Group by category Order by discount DESC;

 * sqlite:///db_sales
Done.

[('Furniture', 0.27, 2012),
 ('Office Supplies', 0.17, 2012),
 ('Technology', 0.0, 2012)]

---

### 4.6.LIKE 

* LIKE Operator in SQL displays only those data from the table which matches the pattern specified in the query. Percentage (%) and underscore (_) are the two *wildcard* operators used with LIKE Operator to perform pattern matching tasks.

In [39]:
# A% means starts with A
%sql  SELECT DISTINCT(country) FROM sales_d WHERE country LIKE 'A%' ;

 * sqlite:///db_sales
Done.

[('Algeria',),
 ('Australia',),
 ('Angola',),
 ('Austria',),
 ('Azerbaijan',),
 ('Albania',),
 ('Argentina',),
 ('Afghanistan',),
 ('Armenia',)]

In [40]:
# %a means ends with a
%sql  SELECT DISTINCT(region) FROM sales_d WHERE region LIKE '%a' ;

 * sqlite:///db_sales
Done.

[('Africa',),
 ('Oceania',),
 ('EMEA',),
 ('Canada',),
 ('Southeast Asia',),
 ('North Asia',),
 ('Central Asia',)]

In [41]:
# %na% means 'na' any where in the string
%sql SELECT DISTINCT(country) FROM sales_d WHERE country LIKE '%na%' ;

 * sqlite:///db_sales
Done.

[('Canada',),
 ('Vietnam',),
 ('China',),
 ('Panama',),
 ('Argentina',),
 ('Ghana',),
 ('Bosnia and Herzegovina',),
 ('Namibia',)]

In [42]:
# '_r% means the second letter of the string is r
%sql SELECT DISTINCT(country) FROM sales_d WHERE country LIKE '_r%' ;

 * sqlite:///db_sales
Done.

[('Iraq',),
 ('Iran',),
 ('Brazil',),
 ('France',),
 ('Ireland',),
 ('Argentina',),
 ('Croatia',),
 ('Uruguay',),
 ('Armenia',),
 ('Trinidad and Tobago',),
 ('Sri Lanka',),
 ('Eritrea',)]

In [43]:
## 'ir_ _% means the string starts with ir.
%sql SELECT DISTINCT(country) FROM sales_d WHERE country LIKE 'ir__%' ;

 * sqlite:///db_sales
Done.

[('Iraq',), ('Iran',), ('Ireland',)]

In [44]:
# 'a%a' means the string starts with a and ends with a.
%sql SELECT DISTINCT(country) FROM sales_d WHERE country LIKE 'a%a' ;

 * sqlite:///db_sales
Done.

[('Algeria',),
 ('Australia',),
 ('Angola',),
 ('Austria',),
 ('Albania',),
 ('Argentina',),
 ('Armenia',)]

---

### 4.7.EXISTS	
* Returns TRUE if the subquery returns one or more records

In [45]:
%sql SELECT distinct(sub_category) FROM sales_d  WHERE EXISTS (SELECT country FROM sales_d WHERE sub_category LIKE 's%s')
#as the sub query is true, main query returns all its results

 * sqlite:///db_sales
Done.

[('Storage',),
 ('Supplies',),
 ('Paper',),
 ('Furnishings',),
 ('Machines',),
 ('Appliances',),
 ('Copiers',),
 ('Chairs',),
 ('Tables',),
 ('Bookcases',),
 ('Phones',),
 ('Accessories',),
 ('Labels',),
 ('Art',),
 ('Envelopes',),
 ('Fasteners',),
 ('Binders',)]

---

# 5.REGEXP 
REGEXP operator is used for pattern matching. It compares the given pattern in the input string and returns the result which is matching with the patterns.

In [46]:
#to search for an region whose name start with A or I, 
%sql SELECT distinct(region) FROM sales_d WHERE country REGEXP '^[AI]';

 * sqlite:///db_sales
Done.

[('Africa',),
 ('Oceania',),
 ('EMEA',),
 ('Southeast Asia',),
 ('Central Asia',),
 ('Central',),
 ('South',),
 ('North',)]

In [47]:
#to get the employee whose name contains exactly four characters, we need to use the '^' and '$ meta-characters. 

%sql SELECT region FROM sales_d WHERE region REGEXP '^{5}$';

 * sqlite:///db_sales
Done.

[]

In [48]:
#to get the sub category detail which contains 'er' characters

%sql  SELECT distinct(sub_category) FROM sales_d WHERE sub_category REGEXP 'er';

 * sqlite:///db_sales
Done.

[('Paper',), ('Copiers',), ('Fasteners',), ('Binders',)]

In [49]:
##to get the sub category detail which contains 'e' or 'r' characters

%sql  SELECT distinct(sub_category) FROM sales_d WHERE sub_category REGEXP 'e|r';

 * sqlite:///db_sales
Done.

[('Storage',),
 ('Supplies',),
 ('Paper',),
 ('Furnishings',),
 ('Machines',),
 ('Appliances',),
 ('Copiers',),
 ('Chairs',),
 ('Tables',),
 ('Bookcases',),
 ('Phones',),
 ('Accessories',),
 ('Labels',),
 ('Art',),
 ('Envelopes',),
 ('Fasteners',),
 ('Binders',)]

---

# 6.IS_NULL

* IS NULL operator is used to test for empty values (NULL values).
* Null values are used to represent missing unknown data.


-->There can be two conditions:

>* Where SQL is NULL (select records with null values only)
>* Where SQL is NOT NULL(select records with no null valuesin  column)

In [50]:
#IS NULL - finding the records with null values
%sql SELECT country, sales FROM sales_d WHERE sales IS NULL  ;

 * sqlite:///db_sales
Done.

[('New Zealand', None),
 ('Tanzania', None),
 ('Cuba', None),
 ('United States', None),
 ('Netherlands', None),
 ('Hungary', None)]

In [51]:
#IS NULL - counting the records with null values
%sql SELECT COUNT(*) AS 'Count_of_null_values' FROM sales_d WHERE sales IS NULL  ;

 * sqlite:///db_sales
Done.

[(6,)]

In [52]:
#IS NOT NULL - counting the records without null values
%sql SELECT COUNT(*) AS 'Count_of_not_null_values' FROM sales_d WHERE sales IS NOT NULL  ;

 * sqlite:///db_sales
Done.

[(51284,)]

---

# 7. Duplicate_records
* Duplicate records in SQL, also known as duplicate rows, are identical rows in an SQL table. This means, for a pair of duplicate records, the values in each column coincide.

In [53]:
#code to find count of duplicate values in the table
%sql SELECT country, COUNT(country) FROM sales_d GROUP BY country HAVING COUNT(country) > 1;

 * sqlite:///db_sales
Done.

[('Afghanistan', 55),
 ('Albania', 16),
 ('Algeria', 196),
 ('Angola', 122),
 ('Argentina', 390),
 ('Armenia', 3),
 ('Australia', 2837),
 ('Austria', 331),
 ('Azerbaijan', 29),
 ('Bahrain', 2),
 ('Bangladesh', 163),
 ('Barbados', 26),
 ('Belarus', 80),
 ('Belgium', 147),
 ('Benin', 35),
 ('Bolivia', 48),
 ('Bosnia and Herzegovina', 17),
 ('Brazil', 1599),
 ('Bulgaria', 75),
 ('Burundi', 2),
 ('Cambodia', 45),
 ('Cameroon', 110),
 ('Canada', 384),
 ('Central African Republic', 7),
 ('Chad', 2),
 ('Chile', 143),
 ('China', 1880),
 ('Colombia', 360),
 ("Cote d'Ivoire", 109),
 ('Croatia', 32),
 ('Cuba', 724),
 ('Czech Republic', 71),
 ('Democratic Republic of the Congo', 379),
 ('Denmark', 65),
 ('Djibouti', 12),
 ('Dominican Republic', 742),
 ('Ecuador', 56),
 ('Egypt', 487),
 ('El Salvador', 736),
 ('Equatorial Guinea', 3),
 ('Eritrea', 2),
 ('Estonia', 13),
 ('Ethiopia', 7),
 ('Finland', 64),
 ('France', 2827),
 ('Gabon', 14),
 ('Georgia', 33),
 ('Germany', 2065),
 ('Ghana', 102),
 ('Guadeloupe', 8),
 ('Guatemala', 521),
 ('Guinea', 18),
 ('Guinea-Bissau', 9),
 ('Haiti', 104),
 ('Honduras', 713),
 ('Hong Kong', 21),
 ('Hungary', 66),
 ('India', 1555),
 ('Indonesia', 1390),
 ('Iran', 607),
 ('Iraq', 388),
 ('Ireland', 106),
 ('Israel', 103),
 ('Italy', 1108),
 ('Jamaica', 31),
 ('Japan', 250),
 ('Jordan', 42),
 ('Kazakhstan', 101),
 ('Kenya', 98),
 ('Kyrgyzstan', 40),
 ('Lebanon', 12),
 ('Lesotho', 6),
 ('Liberia', 15),
 ('Libya', 39),
 ('Lithuania', 50),
 ('Macedonia', 4),
 ('Madagascar', 56),
 ('Malaysia', 176),
 ('Mali', 43),
 ('Martinique', 25),
 ('Mauritania', 10),
 ('Mexico', 2644),
 ('Moldova', 39),
 ('Mongolia', 37),
 ('Montenegro', 4),
 ('Morocco', 451),
 ('Mozambique', 94),
 ('Myanmar (Burma)', 136),
 ('Namibia', 9),
 ('Nepal', 19),
 ('Netherlands', 435),
 ('New Zealand', 628),
 ('Nicaragua', 614),
 ('Niger', 43),
 ('Nigeria', 905),
 ('Norway', 70),
 ('Pakistan', 249),
 ('Panama', 388),
 ('Papua New Guinea', 22),
 ('Paraguay', 12),
 ('Peru', 162),
 ('Philippines', 681),
 ('Poland', 252),
 ('Portugal', 70),
 ('Qatar', 16),
 ('Republic of the Congo', 6),
 ('Romania', 173),
 ('Russia', 384),
 ('Rwanda', 36),
 ('Saudi Arabia', 361),
 ('Senegal', 112),
 ('Sierra Leone', 15),
 ('Singapore', 141),
 ('Slovakia', 8),
 ('Slovenia', 3),
 ('Somalia', 52),
 ('South Africa', 461),
 ('South Korea', 172),
 ('South Sudan', 2),
 ('Spain', 859),
 ('Sri Lanka', 7),
 ('Sudan', 92),
 ('Swaziland', 2),
 ('Sweden', 203),
 ('Switzerland', 78),
 ('Syria', 29),
 ('Taiwan', 14),
 ('Tajikistan', 3),
 ('Tanzania', 148),
 ('Thailand', 295),
 ('Togo', 44),
 ('Trinidad and Tobago', 30),
 ('Tunisia', 13),
 ('Turkey', 1378),
 ('Turkmenistan', 25),
 ('Uganda', 37),
 ('Ukraine', 381),
 ('United Arab Emirates', 14),
 ('United Kingdom', 1633),
 ('United States', 9994),
 ('Uruguay', 24),
 ('Uzbekistan', 48),
 ('Venezuela', 194),
 ('Vietnam', 265),
 ('Yemen', 30),
 ('Zambia', 102),
 ('Zimbabwe', 80)]

In [54]:
##code to find duplicate values from multiple columns
%sql SELECT country, region FROM sales_d GROUP BY country, region HAVING (COUNT(country) > 1) AND (COUNT(region) > 1);

 * sqlite:///db_sales
Done.

[('Afghanistan', 'Central Asia'),
 ('Albania', 'EMEA'),
 ('Algeria', 'Africa'),
 ('Angola', 'Africa'),
 ('Argentina', 'South'),
 ('Armenia', 'EMEA'),
 ('Australia', 'Oceania'),
 ('Austria', 'Central'),
 ('Austria', 'EMEA'),
 ('Azerbaijan', 'EMEA'),
 ('Bahrain', 'EMEA'),
 ('Bangladesh', 'Central Asia'),
 ('Barbados', 'Caribbean'),
 ('Belarus', 'EMEA'),
 ('Belgium', 'Central'),
 ('Benin', 'Africa'),
 ('Bolivia', 'South'),
 ('Bosnia and Herzegovina', 'EMEA'),
 ('Brazil', 'South'),
 ('Bulgaria', 'EMEA'),
 ('Burundi', 'Africa'),
 ('Cambodia', 'Southeast Asia'),
 ('Cameroon', 'Africa'),
 ('Canada', 'Canada'),
 ('Central African Republic', 'Africa'),
 ('Chad', 'Africa'),
 ('Chile', 'South'),
 ('China', 'North Asia'),
 ('Colombia', 'South'),
 ("Cote d'Ivoire", 'Africa'),
 ('Croatia', 'EMEA'),
 ('Cuba', 'Caribbean'),
 ('Czech Republic', 'EMEA'),
 ('Democratic Republic of the Congo', 'Africa'),
 ('Denmark', 'North'),
 ('Djibouti', 'Africa'),
 ('Dominican Republic', 'Caribbean'),
 ('Ecuador', 'South'),
 ('Egypt', 'Africa'),
 ('El Salvador', 'Central'),
 ('Equatorial Guinea', 'Africa'),
 ('Eritrea', 'Africa'),
 ('Estonia', 'EMEA'),
 ('Ethiopia', 'Africa'),
 ('Finland', 'North'),
 ('France', 'Central'),
 ('Gabon', 'Africa'),
 ('Georgia', 'EMEA'),
 ('Germany', 'Central'),
 ('Ghana', 'Africa'),
 ('Guadeloupe', 'Caribbean'),
 ('Guatemala', 'Central'),
 ('Guinea', 'Africa'),
 ('Guinea-Bissau', 'Africa'),
 ('Haiti', 'Caribbean'),
 ('Honduras', 'Central'),
 ('Hong Kong', 'North Asia'),
 ('Hungary', 'EMEA'),
 ('India', 'Central Asia'),
 ('Indonesia', 'Southeast Asia'),
 ('Iran', 'EMEA'),
 ('Iraq', 'EMEA'),
 ('Ireland', 'North'),
 ('Israel', 'EMEA'),
 ('Italy', 'South'),
 ('Jamaica', 'Caribbean'),
 ('Japan', 'North Asia'),
 ('Jordan', 'EMEA'),
 ('Kazakhstan', 'EMEA'),
 ('Kenya', 'Africa'),
 ('Kyrgyzstan', 'EMEA'),
 ('Lebanon', 'EMEA'),
 ('Lesotho', 'Africa'),
 ('Liberia', 'Africa'),
 ('Libya', 'Africa'),
 ('Lithuania', 'EMEA'),
 ('Macedonia', 'EMEA'),
 ('Madagascar', 'Africa'),
 ('Malaysia', 'Southeast Asia'),
 ('Mali', 'Africa'),
 ('Martinique', 'Caribbean'),
 ('Mauritania', 'Africa'),
 ('Mexico', 'North'),
 ('Moldova', 'EMEA'),
 ('Mongolia', 'EMEA'),
 ('Montenegro', 'EMEA'),
 ('Morocco', 'Africa'),
 ('Mozambique', 'Africa'),
 ('Myanmar (Burma)', 'Southeast Asia'),
 ('Namibia', 'Africa'),
 ('Nepal', 'Central Asia'),
 ('Netherlands', 'Central'),
 ('New Zealand', 'Oceania'),
 ('Nicaragua', 'Central'),
 ('Niger', 'Africa'),
 ('Nigeria', 'Africa'),
 ('Norway', 'North'),
 ('Pakistan', 'Central Asia'),
 ('Panama', 'Central'),
 ('Papua New Guinea', 'Oceania'),
 ('Paraguay', 'South'),
 ('Peru', 'South'),
 ('Philippines', 'Southeast Asia'),
 ('Poland', 'EMEA'),
 ('Portugal', 'South'),
 ('Qatar', 'EMEA'),
 ('Republic of the Congo', 'Africa'),
 ('Romania', 'EMEA'),
 ('Russia', 'EMEA'),
 ('Rwanda', 'Africa'),
 ('Saudi Arabia', 'EMEA'),
 ('Senegal', 'Africa'),
 ('Sierra Leone', 'Africa'),
 ('Singapore', 'Southeast Asia'),
 ('Slovakia', 'EMEA'),
 ('Slovenia', 'EMEA'),
 ('Somalia', 'Africa'),
 ('South Africa', 'Africa'),
 ('South Korea', 'North Asia'),
 ('South Sudan', 'Africa'),
 ('Spain', 'South'),
 ('Sri Lanka', 'Central Asia'),
 ('Sudan', 'Africa'),
 ('Swaziland', 'Africa'),
 ('Sweden', 'North'),
 ('Switzerland', 'Central'),
 ('Syria', 'EMEA'),
 ('Taiwan', 'North Asia'),
 ('Tajikistan', 'EMEA'),
 ('Tanzania', 'Africa'),
 ('Thailand', 'Southeast Asia'),
 ('Togo', 'Africa'),
 ('Trinidad and Tobago', 'Caribbean'),
 ('Tunisia', 'Africa'),
 ('Turkey', 'EMEA'),
 ('Turkmenistan', 'EMEA'),
 ('Uganda', 'Africa'),
 ('Ukraine', 'EMEA'),
 ('United Arab Emirates', 'EMEA'),
 ('United Kingdom', 'North'),
 ('United States', 'Central'),
 ('United States', 'East'),
 ('United States', 'South'),
 ('United States', 'West'),
 ('Uruguay', 'South'),
 ('Uzbekistan', 'EMEA'),
 ('Venezuela', 'South'),
 ('Vietnam', 'Southeast Asia'),
 ('Yemen', 'EMEA'),
 ('Zambia', 'Africa'),
 ('Zimbabwe', 'Africa')]

---

# 8.If

* IF function is control flow function, which returns a value based on the given conditions.The IF function returns a value YES when the given condition evaluates to true and returns a NO value when the condition evaluates to false. The IF() function accepts one parameter which is the condition to be evaluated.

In [55]:
#SQLite uses IIF function instead of IF, and returns 1 -True, 0 -False
%sql SELECT segment, profit, IIF(profit>20, "True", "False" ) As Result FROM sales_d limit 10;

 * sqlite:///db_sales
Done.

[('Consumer', 106.14, 1),
 ('Consumer', 36.036, 1),
 ('Consumer', 29.64, 1),
 ('Home Office', -26.055, 0),
 ('Consumer', 37.77, 1),
 ('Consumer', 15.342, 0),
 ('Consumer', 3.12, 0),
 ('Corporate', 110.412, 1),
 ('Consumer', -319.464, 0),
 ('Corporate', 253.32, 1)]

---

# 9.VIEW

In SQL, a view is a virtual table based on the result-set of an SQL statement.

A view contains rows and columns, just like a real table. The fields in a view are fields from one or more real tables in the database.

You can add SQL statements and functions to a view and present the data as if the data were coming from one single table.

A view is created with the CREATE VIEW statement.

In [56]:
# creating View for sales in africa

%sql CREATE VIEW[Top_profit] AS SELECT category, round(profit) FROM sales_d WHERE profit > 4000 Order by profit DESC;

 * sqlite:///db_sales
Done.

[]

In [57]:
#Querying the created view

%sql SELECT * FROM Top_profit;

 * sqlite:///db_sales
Done.

[('Technology', 8400.0),
 ('Technology', 6720.0),
 ('Technology', 5040.0),
 ('Office Supplies', 4946.0),
 ('Office Supplies', 4630.0)]

In [58]:
#Drop view is used to delete view
%sql DROP View Top_profit;

 * sqlite:///db_sales
Done.

[]

In [59]:
# cross checking view
%sql select max(profit) from sales_d;

 * sqlite:///db_sales
Done.

[(8399.976,)]

---

# 10.substr
* substr() returns the specified number of characters from a particular position of a given string.

In [60]:
#substr(string, 4,3) returns 3 numbers of characters from the 4th position of the string .
%sql SELECT country, substr(country ,4,3 ) from sales_d limit 5;

 * sqlite:///db_sales
Done.

[('Algeria', 'eri'),
 ('Australia', 'tra'),
 ('Hungary', 'gar'),
 ('Sweden', 'den'),
 ('Australia', 'tra')]

In [61]:
# substr(string,3) function extracts rest characters from a specific position
%sql SELECT country, substr(country ,3 ) from sales_d limit 5;

 * sqlite:///db_sales
Done.

[('Algeria', 'geria'),
 ('Australia', 'stralia'),
 ('Hungary', 'ngary'),
 ('Sweden', 'eden'),
 ('Australia', 'stralia')]

---

# 11.CASE_statement

* The CASE statement in SQL returns a value for the condition specified. It tests a list of conditions and returns one of the multiple possible results. 
* The CASE statement in SQL is a way of handling the IF/THEN logic. The CASE statement is always followed by a minimum of one pair of WHEN and THEN statements.

#**Example1 Syntax**


SELECT DISTINCT(category), profit, <br>
>CASE  
>WHEN profit >= 50 THEN 'Profitable'   <br>
>ELSE 'Less Profit'   <br>
>END AS Profit_Result  <br>

FROM sales_d limit 10;

In [62]:
#execution
%sql SELECT DISTINCT(category), profit, CASE  WHEN profit >= 50 THEN 'Profitable'  ELSE 'Less Profit'  END AS Profit_Result FROM sales_d limit 10;

 * sqlite:///db_sales
Done.

[('Office Supplies', 106.14, 'Profitable'),
 ('Office Supplies', 36.036, 'Less Profit'),
 ('Office Supplies', 29.64, 'Less Profit'),
 ('Office Supplies', -26.055, 'Less Profit'),
 ('Furniture', 37.77, 'Less Profit'),
 ('Office Supplies', 15.342, 'Less Profit'),
 ('Technology', 3.12, 'Less Profit'),
 ('Office Supplies', 110.412, 'Profitable'),
 ('Technology', -319.464, 'Less Profit'),
 ('Furniture', 253.32, 'Profitable')]

---

#**Example2 Syntax**

SELECT DISTINCT(category), profit, <br>
>CASE  
>WHEN profit >= 80 THEN 'More Profit'  <br>
>WHEN profit >= 50 THEN 'Profitable'   <br>
>WHEN profit >= 30 THEN 'Average profit' <br>
>ELSE 'Less Profit'                    <br>
>END AS Profit_Result                  <br>

FROM sales_d limit 10;

In [63]:
#execution
%sql SELECT DISTINCT(sub_category), profit, CASE WHEN profit >= 80 THEN 'More Profit' WHEN profit >= 50 THEN 'Profitable' WHEN profit >= 30 THEN 'Average profit' ELSE 'Less Profit' END AS profit_Result FROM sales_d limit 10;

 * sqlite:///db_sales
Done.

[('Storage', 106.14, 'More Profit'),
 ('Supplies', 36.036, 'Average profit'),
 ('Storage', 29.64, 'Less Profit'),
 ('Paper', -26.055, 'Less Profit'),
 ('Furnishings', 37.77, 'Average profit'),
 ('Paper', 15.342, 'Less Profit'),
 ('Machines', 3.12, 'Less Profit'),
 ('Appliances', 110.412, 'More Profit'),
 ('Copiers', -319.464, 'Less Profit'),
 ('Chairs', 253.32, 'More Profit')]

---

#**Example3 Syntax using *group by* and *order by***

SELECT year, profit, <br>

>CASE <br>
>WHEN profit >= 200 THEN 'More Profit' <br>
>WHEN profit >= 100 THEN 'Profitable' <br>
>WHEN profit >= 30 THEN 'Average profit' <br>
>ELSE 'Less Profit' <br>
>END AS profit_Result <br>

FROM sales_d <br>
GROUP BY year <br>
ORDER BY profit DESC;

In [64]:
#execution
%sql SELECT year, profit, CASE WHEN profit >= 200 THEN 'More Profit' WHEN profit >= 100 THEN 'Profitable' WHEN profit >= 30 THEN 'Average profit' ELSE 'Less Profit' END AS profit_Result FROM sales_d GROUP BY year ORDER BY profit DESC;

 * sqlite:///db_sales
Done.

[(2012, 339.8778, 'More Profit'),
 (2011, 106.14, 'Profitable'),
 (2013, 36.624, 'Average profit'),
 (2014, -111.6225, 'Less Profit')]

---

#**Example4 Syntax to count *Null values***

SELECT 

>SUM(CASE when sales is null then 1 else 0 end) as 'NUll_in_Sales', <br>
>SUM(CASE when profit is null then 1 else 0 end) as 'NUll_in_profit' 

from sales_d;

In [65]:
#execution
%sql SELECT SUM(CASE when sales is null then 1 else 0 end) as 'NUll_in_Sales', SUM(CASE when profit is null then 1 else 0 end) as 'NUll_in_profit' from sales_d;

 * sqlite:///db_sales
Done.

[(6, 0)]

---

# 12.Subquery

A Subquery or Inner query or Nested query is a query within another SQL query and embedded within the WHERE clause.

A subquery is used to return data that will be used in the main query as a condition to further restrict the data to be retrieved.

In [66]:
#Query to select the sub categories whose profit is greater than 2000 using sub query
%sql SELECT DISTINCT(sub_category) FROM sales_d WHERE sub_category IN(SELECT sub_category FROM sales_d WHERE profit>2000);

 * sqlite:///db_sales
Done.

[('Machines',),
 ('Appliances',),
 ('Copiers',),
 ('Tables',),
 ('Bookcases',),
 ('Phones',),
 ('Binders',)]

In [67]:
#QUERY to select state with profit greater that sum profit of state Qubec
%sql SELECT country , state, profit FROM sales_d WHERE profit > (SELECT sum(profit) from sales_d where state = 'Quebec');

 * sqlite:///db_sales
Done.

[('United States', 'Minnesota', 4630.4755),
 ('United States', 'Georgia', 3177.475),
 ('United States', 'Indiana', 8399.976),
 ('United States', 'Michigan', 4946.37),
 ('United States', 'Washington', 6719.9808),
 ('Italy', 'Tuscany', 3979.08),
 ('United States', 'New York', 3919.9888),
 ('United States', 'Delaware', 5039.9856)]

## Conclusion: 
> We have seen , learnt and executed a range of SQL functions, commands, statements which help us in queriying and extracting data so that we can have insights on the extracted output. Thank you for reading all the way to the end.